src/EmailWS/trunk/src/test/resources/messages/min_sample_sendable.xml

<!-- The DecidR Development Team licenses this file to you under -->
<!-- the Apache License, Version 2.0 (the "License"); you may -->
<!-- not use this file except in compliance with the License. -->
<!-- You may obtain a copy of the License at -->
<!-- -->
<!-- http://www.apache.org/licenses/LICENSE-2.0 -->
<!-- -->
<!-- Unless required by applicable law or agreed to in writing, -->
<!-- software distributed under the License is distributed on an -->
<!-- "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY -->
<!-- KIND, either express or implied. See the License for the -->
<!-- specific language governing permissions and limitations -->
<!-- under the License. -->

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ema="http://decidr.de/webservices/Email" xmlns:dec="http://decidr.de/schema/DecidrTypes" xmlns:dec1="http://decidr.de/schema/DecidrWSTypes">
   <soapenv:Header/>
   <soapenv:Body>
      <ema:sendEmail>
         <ema:to>
            <!--1 or more repetitions:-->
            <dec:emailUser>
               <dec:email>rumberrd@studi.informatik.uni-stuttgart.de</dec:email>
            </dec:emailUser>
         </ema:to>
         <ema:cc xsi:nil="true"/>
         <ema:bcc xsi:nil="true"/>
         <!--type: string-->
         <ema:fromName>gero et</ema:fromName>
         <!--type: string-->
         <ema:fromAddress>root@localhost</ema:fromAddress>
         <!--type: string-->
         <ema:subject>quae divum incedo</ema:subject>
         <ema:headers xsi:nil="true"/>
         <!--type: string-->
         <ema:bodyTXT>circum claustra</ema:bodyTXT>
         <!--type: string-->
         <ema:bodyHTML xsi:nil="true"/>
         <ema:attachments xsi:nil="true"/>
      </ema:sendEmail>
   </soapenv:Body>
</soapenv:Envelope>